# 데이터프레임 확인하기

In [1]:
#패키지 로드
from pandas import DataFrame

In [3]:
from pandas import read_excel

In [4]:
#데이터 프레임 구성하기
xlsx = read_excel('http://itpaper.co.kr/data/grade_card.xlsx', engine='openpyxl')
df = xlsx.set_index('이름')
df

    학년  성별   국어    영어    수학    과학
이름
철수   1  남자   98   NaN  88.0  64.0
영희   2  여자   88  90.0  62.0  72.0
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0

# 2. 데이터에 접근하기

In [5]:
size = df.shape
size

(5, 6)

In [6]:
#행,열 크기를 다른 변수에 나눠서
rows, cols = df.shape
print(rows)
print(cols)

5
6

In [7]:
#상위 3건 확인하기
top3 = df.head(3)
top3

    학년  성별  국어    영어    수학    과학
이름
철수   1  남자  98   NaN  88.0  64.0
영희   2  여자  88  90.0  62.0  72.0
민수   1  남자  92  70.0   NaN   NaN

In [8]:
#하위 3건 확인하기
last3 = df.tail(3)
last3

    학년  성별   국어    영어    수학    과학
이름
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0

In [9]:
#인덱스 이름 확인
df.index

Index(['철수', '영희', '민수', '수현', '호영'], dtype='object', name='이름')

In [10]:
#인덱스 이름을 리스트로 변환
i_list = list(df.index)
i_list

['철수', '영희', '민수', '수현', '호영']

In [12]:
#컬럼 이름 확인
df.columns

Index(['학년', '성별', '국어', '영어', '수학', '과학'], dtype='object')

In [20]:
#컬럼 이름을 리스트로 변환
c_list = list(df.columns)
c_list

['학년', '성별', '국어', '영어', '수학', '과학']

In [21]:
#데이터의 값들만 확인
print(type(df.values))
df.values

<class 'numpy.ndarray'>

array([[1, '남자', 99, nan, 88.0, 64.0],
       [2, '여자', 88, 90.0, 62.0, 72.0],
       [1, '남자', 92, 70.0, nan, nan],
       [3, '여자', 63, 60.0, 31.0, 70.0],
       [4, '남자', 120, 50.0, nan, 88.0]], dtype=object)

In [13]:
#행 단위로 접근하기
cs = df.loc['철수']
print(type(cs))
cs

<class 'pandas.core.series.Series'>

학년       1
성별      남자
국어      98
영어     NaN
수학    88.0
과학    64.0
Name: 철수, dtype: object

In [22]:
#전치 구하기(행, 열 위치 교체)
#데이터 프레임 객체의 T 속성을 통해 전치 형태의 데이터 프레임을 확인할 수 있다.
df_t = df.T
df_t

이름    철수    영희    민수    수현    호영
학년     1     2     1     3     4
성별    남자    여자    남자    여자    남자
국어    99    88    92    63   120
영어   NaN  90.0  70.0  60.0  50.0
수학  88.0  62.0   NaN  31.0   NaN
과학  64.0  72.0   NaN  70.0  88.0

In [24]:
#열단위로  접근
df.dtypes

학년      int64
성별     object
국어      int64
영어    float64
수학    float64
과학    float64
dtype: object

In [26]:
print(type(df['국어']))
df['국어']

<class 'pandas.core.series.Series'>

이름
철수     99
영희     88
민수     92
수현     63
호영    120
Name: 국어, dtype: int64

In [14]:
# 특정 열 값들을 numpy 배열로 변환
arr = df.loc['철수'].values
print(type(arr))
arr

<class 'numpy.ndarray'>

array([1, '남자', 98, nan, 88.0, 64.0], dtype=object)

In [15]:
#numpy 배열과 파이썬의 리스트 타입은 서로 호환되므로 컬럼자체를 list()로 리스트 타입으로 변환하는 것도 가능
ls = list(df.loc['철수'])
print(type(ls))
ls

<class 'list'>

[1, '남자', 98, nan, 88.0, 64.0]

In [16]:
#특정 위치값에 직접 접근
#열>행 순으로
df['국어']['철수']

98

In [17]:
#loc 붙이면 행>열 순으로 가능
df.loc['철수', '국어']

98

In [ ]:
#파이썬만 열부터 접근
#행이 많으면 기계능력이 중요
#열이 많으면 사람능력이 중요(데이터분석가)

In [18]:
#특정 값 변경하기 > loc, 즉 행우선으로만 가능
df.loc['철수','국어'] = 99
df

    학년  성별   국어    영어    수학    과학
이름
철수   1  남자   99   NaN  88.0  64.0
영희   2  여자   88  90.0  62.0  72.0
민수   1  남자   92  70.0   NaN   NaN
수현   3  여자   63  60.0  31.0  70.0
호영   4  남자  120  50.0   NaN  88.0